{
  "user": {
    "name": "Parthiv Gandhi",
    "email": "parthivgandhi1499@gmail.com",
    "resume_url": "https://www.parthivgandhi.com/resume/resume.pdf",
    "logo_text": "parthiv-gandhi",
    "user_preferred_titles": [
      "Data Scientist",
      "Cloud Engineer",
      "Software Engineer"
    ],
    "bio": "ABOUT ME\n\nParthiv Gandhi, 26\nWashington DC, USA\n\nI have a knee eye for analytical  skills to help see through data and numbers. Love to fill the gap between tech and business needs – a car enthusiasts and tech nerd.\n\nFeel free to drop me a message if you want to chat about tech, football, or the best YouTube rabbit holes—I'm always up for a good conversation!",
    "education": [
      {
        "title": "Masters",
        "school": "University of Maryland, Baltimore County",
        "degree": "Master of Science in Information Systems",
        "description": "Masters\n Masters in Information Systems, University of Maryland, Baltimore County\nBaltimore, USA\nAug 2022 - Dec 2024\n\nCoursework : Supervised Machine Learning and Deep Learning, Unsupervised Machine Learning and Data Mining, Natural Language Processing, Reinforcement Learning and Computer Vision, Introduction to Linear Algebra, Probability and Statistics.",
        "place": "Baltimore, USA"
      },
      {
        "title": "Bachelors",
        "school": "PDEU",
        "degree": "BTech in Information Communication Technologies",
        "description": "Bachelors\nBachelors in Information Communication Technologies, PDEU\nAhmedabad, India\nJuly 2017 - May 2021\n\nCoursework : Artificial Intelligence, Big Data Analytics and Distributed Computing, Data Warehousing, Evaluation and Optimization, Object Oriented Programming and Modelling, Database Management System, Data Structures and Algorithms.",
        "place": "Ahmedabad, India"
      }
    ],
    "work": [
      {
        "title": "Data Analyst",
        "company": "Haohan Technologies",
        "start": "Jan 25",
        "end": "Present",
        "description": "Haohan Technologies\nData Analyst\nClarksville, Maryland, USA\nJan 2025 - Present\n\nTech Stack : Tableau, Python (PySpark), SQL, AWS SageMaker, Lambda, Redshift, Apache Airflow, PostgreSQL, Azure Synapse, Databricks, Informatica, JIRA, MS Visio\n\nLed analytics on 13.5 GB+ datasets, improving customer retention 15% and sales 12%.\nBuilt interactive Tableau dashboards and optimized ETL pipelines (Informatica, PySpark, SQL), boosting data completeness to 98% and query speed by 50%.\nAutomated 15+ ETL/reporting workflows with Airflow, saving 10+ hours/week.\nDeployed ML models via AWS SageMaker & Lambda, reducing latency by 30%.\nDelivered insights driving $500K inventory savings and 66% reporting efficiency gains.",
        "place": "Clarksville, Maryland, USA"
      },
      {
        "title": "Data Analyst",
        "company": "Spectrum Webapps",
        "start": "Sep 19",
        "end": "Jul 22",
        "description": "Spectrum Webapps\nData Analyst\nAhmedabad, Gujarat, India\nSeptember 2019 - July 2022\n\nTech Stack : Python (Pandas, Scikit-learn), SQL Server, AWS (S3, Redshift, SageMaker, Lambda), Docker, Kubernetes, Flask, Shopify API, Power BI, ARIMA, LSTM, XGBoost, Logistic Regression, K-Means, RFM Segmentation, Git, Agile (Scrum)\n\nLed e-commerce sales forecasting and data analytics, delivering actionable insights that improved retention by 18%and sales by 22%.\nBuilt AWS S3 & Redshift data lake integrating sales, CRM, web analytics, and inventory for cross-functional access.\nCreated time series forecasting models (ARIMA, LSTM) achieving 8.7% MAPE, reducing demand planning errors.\nImplemented churn prediction (Logistic Regression, XGBoost) and segmentation (RFM, K-Means) to enhance customer targeting.\nDeployed real-time ML models on AWS with Docker & Kubernetes, integrating Flask APIs into Shopify workflows.\nAutomated Power BI dashboards, cutting manual reporting by 30% and accelerating stakeholder decision-making.\nOptimized inventory turnover by 35% and reduced stockouts by 22% using predictive analytics.\nConducted A/B and hypothesis testing on pricing/promotions, reducing acquisition costs by 15%.\nCollaborated with IT, marketing, and operations teams in Agile (Scrum) environments for on-time project delivery.",
        "place": "Ahmedabad, Gujarat, India"
      }
    ],
    "projects": [
      {
        "name": "AI License Plate Detection",
        "description": "Implemented an automated license plate recognition system for Indian vehicles using a computer vision pipeline. The model captures images/video frames, detects the plate region via Haar cascade classifiers, applies preprocessing (grayscale conversion, thresholding, noise removal), and segments individual characters. A Convolutional Neural Network (Keras/TensorFlow) is trained to classify characters into alphanumeric labels. Outputs are compiled into a complete plate number string. Designed for integration into embedded systems like Raspberry Pi for traffic monitoring, toll automation, and parking management.",
        "image": "/projects/project_images/licenseplate.png",
        "techstack": [
          "python",
          "opencv",
          "keras",
          "tensorflow",
          "jupyter"
        ],
        "github": "",
        "url": ""
      },
      {
        "name": "Boston Airbnb Data Storage & Visualization",
        "description": "Developed a data engineering pipeline to analyze Boston Airbnb listings. The process includes dataset ingestion, preprocessing with Pandas, and structured storage in PostgreSQL for efficient querying. Data is then visualized in Tableau, incorporating geospatial mapping to analyze neighborhood trends, pricing distribution, host activity, and availability patterns. Optimized database schema for faster aggregation queries. The final dashboard provides actionable insights for property investors and urban planners, enabling data-driven decision-making.",
        "image": "/projects/project_images/boston.png",
        "techstack": [
          "python",
          "pandas",
          "postgresql",
          "tableau",
          "jupyter"
        ],
        "github": "",
        "url": ""
      },
      {
        "name": "Financial Market Stock Analysis",
        "description": "Developed a stock price prediction pipeline using historical financial time-series data from Yahoo Finance. Implemented over 90 technical indicators, followed by feature selection via a custom LASSO regression model to remove low-impact predictors. Integrated the optimized features into an LSTM (Long Short-Term Memory) neural network to capture temporal dependencies and improve forecast accuracy. This two-stage approach combines interpretability from LASSO with the sequential learning capabilities of deep learning models, enabling robust and explainable predictions.",
        "image": "/projects/project_images/stocks.jpg",
        "techstack": [
          "python",
          "pandas",
          "numpy",
          "scikit-learn",
          "tensorflow",
          "keras",
          "matplotlib",
          "jupyter"
        ],
        "github": "",
        "url": ""
      },
      {
        "name": "Soccer Events Analytics",
        "description": "This project analyzes soccer game events like goals, assists, shots, blocks, and clearances. Based on this data, it provides various insights into players, their playstyles, and team strategies. The analysis helps determine key patterns and trends in player and team performance.",
        "image": "/projects/project_images/soccer.png",
        "techstack": [
          "python"
        ],
        "github": "",
        "url": ""
      },
      {
        "name": "Instagram Bot Comment detector",
        "description": "This Instagram bot comment remover identifies and reports bot comments, hiding them from the user's view to clean up the comments section. It uses a machine learning model and Selenium automator to scan and analyze comments. The ML classifier is trained on thousands of labeled data points using NLP techniques.",
        "image": "/projects/project_images/instagram.png",
        "techstack": [
          "python"
        ],
        "github": "",
        "url": ""
      }
    ],
    "socials": [
      {
        "name": "Github",
        "link": "https://github.com/parthiv1499",
        "type": "Profile"
      },
      {
        "name": "LinkedIn",
        "link": "https://www.linkedin.com/in/parthivgandhi/",
        "type": "Profile"
      }
    ]
  }
}